[{
  "title": "Led Zeppelin",
  "url": "https://static.qobuz.com/images/covers/ib/zz/q602zd9zvzzib_600.jpg",
  "desc": "Led Zeppelin were an English rock band formed in London in 1968. Originally named the New Yardbirds, they consisted of vocalist Robert Plant, guitarist Jimmy Page, bassist/keyboardist John Paul Jones, and drummer John Bonham. With a heavy, guitar-driven sound, they are cited as one of the progenitors of hard rock and heavy metal, although their style drew from a variety of influences, including blues and folk music. Led Zeppelin have been credited as significantly impacting the nature of the music industry, particularly in the development of album-orientated rock (AOR) and stadium rock. Many critics consider Led Zeppelin one of the most successful, innovative and influential rock groups in history."
}, {
  "title": "The Beatles",
  "url": "https://www.udiscovermusic.com/wp-content/uploads/2020/04/The-Beatles-Let-It-Be-album-cover-820-820x600.jpg",
  "desc": "The Beatles were an English rock band formed in Liverpool in 1960. The group, whose best-known line-up comprised John Lennon, Paul McCartney, George Harrison and Ringo Starr, are regarded as the most influential band of all time.[1] They were integral to the development of 1960s counterculture and popular music's recognition as an art form.[2] Rooted in skiffle, beat and 1950s rock and roll, their sound incorporated elements of classical music and traditional pop in innovative ways; the band later explored music styles ranging from ballads and Indian music to psychedelia and hard rock. As pioneers in recording, songwriting and artistic presentation, the Beatles revolutionised many aspects of the music industry and were often publicised as leaders of the era's youth and sociocultural movements."
}, {
  "title": "Pink Floyd",
  "url": "https://www.muraldecal.com/en/img/asmu299-jpg/folder/products-listado-merchanthover/stickers-pink-floyd-logo.jpg",
  "desc": "Pink Floyd were an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished for their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows, and became a leading band of the progressive rock genre. Pink Floyd were founded by students Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), and Richard Wright (keyboards, vocals). Under Barrett's leadership, they released two charting singles and a successful debut album, The Piper at the Gates of Dawn (1967). Guitarist and vocalist David Gilmour joined in December 1967; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind the band's peak of critical and commercial success with the albums The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977), and The Wall (1979). The Waters-written musical film based on The Wall album, Pink Floyd – The Wall (1982), won two BAFTA Awards."
}, {
  "title": "Radiohead",
  "url": "https://i.pinimg.com/originals/57/98/8e/57988ee7b02ffaa7739ab016527db296.jpg",
  "desc": "Radiohead are an English rock band formed in Abingdon, Oxfordshire, in 1985. The band consists of Thom Yorke (vocals, guitar, piano, keyboards), brothers Jonny Greenwood (lead guitar, keyboards, other instruments) and Colin Greenwood (bass), Ed O'Brien (guitar, backing vocals) and Philip Selway (drums, percussion). They have worked with producer Nigel Godrich and cover artist Stanley Donwood since 1994. Radiohead's experimental approach is credited with advancing the sound of alternative rock."
}, {
  "title": "Guns N' Roses",
  "url": "https://i.pinimg.com/originals/51/bf/f7/51bff712a0198a2461112459f989c1bb.jpg",
  "desc": "Guns N' Roses, often abbreviated as GNR, is an American hard rock band from Los Angeles, California, formed in 1985. When they signed to Geffen Records in 1986, the band comprised vocalist Axl Rose, lead guitarist Slash, rhythm guitarist Izzy Stradlin, bassist Duff McKagan, and drummer Steven Adler. The current lineup consists of Rose, Slash, McKagan, guitarist Richard Fortus, drummer Frank Ferrer and keyboardists Dizzy Reed and Melissa Reese."
}, {
  "title": "Iron Maiden",
  "url": "https://media.npr.org/assets/img/2015/09/11/ironmaiden3_sq-5da71e7c5490fec6cf365a728a2f0a21fd6af793-s800-c85.jpg",
  "desc": "Iron Maiden are an English heavy metal band formed in Leyton, East London, in 1975 by bassist and primary songwriter Steve Harris. The band's discography has grown to 40 albums, including 16 studio albums, 13 live albums, four EPs, and seven compilations."
}, {
  "title": "Metallica",
  "url": "https://t1.pixers.pics/img-1fb6f67c/posters-metallica.jpg?H4sIAAAAAAAAA3WOTW7EIAyFr0OkJDYQAuQGs5sbIAJkmjY_CJh21NOXqOqy8sLv2bLfB88j2yWAC0cJCfbV-y3Asm7V5SmFvH4HIgRvsZnqdCOIVZ2fIbl0RtLVTUcZbUeUreC6mb5svdxt-iBvpcQ8AWTex_VV39XmMrg9A0MqARUIrazzjklLOTNx63Kxh7fJdyO-Buzj8WjxquYPRSK28kIoad1JZTprWCHv8dHAP4G_GuoV3G8gKfDhMuZ-k5QPBvUsRCXwo-JML9RywakXmqFXfpHKiFnaWelllGK2pv8BHU2qyjIBAAA=",
  "desc": "Metallica is an American heavy metal band. The band was formed in 1981 in Los Angeles by vocalist/guitarist James Hetfield and drummer Lars Ulrich, and has been based in San Francisco for most of its career.[1][2] The band's fast tempos, instrumentals and aggressive musicianship made them one of the founding \"big four\" bands of thrash metal, alongside Megadeth, Anthrax and Slayer. Metallica's current lineup comprises founding members and primary songwriters Hetfield and Ulrich, longtime lead guitarist Kirk Hammett, and bassist Robert Trujillo. Guitarist Dave Mustaine (who went on to form Megadeth after being fired from the band) and bassists Ron McGovney, Cliff Burton (who died in a bus accident in Sweden in 1986) and Jason Newsted are former members of the band."
}, {
  "title": "Eric Clapton",
  "url": "https://www.merchandisingplaza.co.uk/34690/2/T-shirts-Eric-Clapton-Eric-Clapton-Retro-Logo--TShirt-l.jpg",
  "desc": "Eric Patrick Clapton, CBE (born 30 March 1945) is an English rock and blues guitarist, singer, and songwriter. He is the only three-time inductee to the Rock and Roll Hall of Fame: once as a solo artist and separately as a member of the Yardbirds and of Cream. Clapton has been referred to as one of the most important and influential guitarists of all time. Clapton ranked second in Rolling Stone's list of the 100 Greatest Guitarists of All Time and fourth in Gibson's Top 50 Guitarists of All Time. He was also named number five in Time magazine's list of The 10 Best Electric Guitar Players in 2009."
}]